#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-AVByt3Rb7YzTHEp1

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Initializing plugins and modules...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
random_password.db_password: Refreshing state... [id=none]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=tf-apply-scheduler]
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-dev-keycloak]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_resource.app: Refreshing state... [id=l8dcc6]
aws_api_gateway_resource.actions: Refreshing state... [id=i57f4h]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
aws_api_gateway_resource.actions_proxy: Refreshing state... [id=cmapde]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
aws_api_gateway_method.actions_proxy: Refreshing state... [id=agm-gcp9dahm4c-cmapde-ANY]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-dev-keycloak,private]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-dev-keycloak]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210817012201712900000001]
aws_lambda_function.scheduler: Refreshing state... [id=lambda-scheduler]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_permission.scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.scheduler: Refreshing state... [id=tf-apply-scheduler-scheduler]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-gcp9dahm4c-cmapde-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=x2sfag]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2022-08-18T19:59:48.833Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_deployment.this must be replaced
-/+ resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2022-03-10T08:29:10Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:220881534007:gcp9dahm4c/test" -> (known after apply)
      ~ id            = "x2sfag" -> (known after apply)
      ~ invoke_url    = "https://gcp9dahm4c.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "22ee332da44566cf4dc1c44a13c4b85eee5a45f9"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.api will be created
  + resource "aws_api_gateway_integration" "api" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "gcp9dahm4c"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.api_proxy will be created
  + resource "aws_api_gateway_method" "api_proxy" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "ANY"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "gcp9dahm4c"
    }

  # aws_api_gateway_resource.api will be created
  + resource "aws_api_gateway_resource" "api" {
      + id          = (known after apply)
      + parent_id   = "irntllxe14"
      + path        = (known after apply)
      + path_part   = "api"
      + rest_api_id = "gcp9dahm4c"
    }

  # aws_api_gateway_resource.api_proxy will be created
  + resource "aws_api_gateway_resource" "api_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = "gcp9dahm4c"
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-08-17T19:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "y7CWq3JI9QGMAkbBxsOmsHCduGmjw5vCCDoqMIZSmao=" -> "dehBCW1NF/tWtOPLRbZD7Bpovr3DO19hxYyccnK1RLo="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-08-17T23:41:03.733+0000" -> (known after apply)
      ~ source_code_hash               = "igeCq6nStqHcQjCeajzTXna+zpXctXZh12MPx4OMGa4=" -> "BtmqUrOnHqPQIsN0dFRXXBDrm2ur2eVEol5LjklX6z4="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.css_api will be created
  + resource "aws_lambda_function" "css_api" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "lambda-css-api.zip"
      + function_name                  = "lambda-css-api"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::220881534007:role/iam_for_lambda"
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "bnWAw+OircMiiYfIR76uithV4FAAuQ/u5265soElW94="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "managed-by" = "terraform"
        }
      + tags_all                       = {
          + "managed-by" = "terraform"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ALLOW_GOLD"                     = "true"
              + "ALLOW_SILVER"                   = "true"
              + "API_URL"                        = "https://gcp9dahm4c.execute-api.ca-central-1.amazonaws.com/test/app"
              + "APP_ENV"                        = "development"
              + "APP_URL"                        = "https://bcgov.github.io/sso-requests-dev"
              + "BCEID_WEBSERVICE_PROXY"         = "https://realm-registry-dev.apps.silver.devops.gov.bc.ca/api/bceid-service"
              + "CHES_API_ENDPOINT"              = "https://ches-dev.apps.silver.devops.gov.bc.ca/api/v1/email"
              + "CHES_PASSWORD"                  = (sensitive)
              + "CHES_TOKEN_ENDPOINT"            = "https://dev.oidc.gov.bc.ca/auth/realms/jbd6rnxw/protocol/openid-connect/token"
              + "CHES_USERNAME"                  = (sensitive)
              + "CONFIGURATION_ENDPOINT"         = "https://dev.oidc.gov.bc.ca/auth/realms/onestopauth/.well-known/openid-configuration"
              + "DB_HOSTNAME"                    = "aurora-db-postgres.cluster-ch8pcggluehm.ca-central-1.rds.amazonaws.com"
              + "DB_NAME"                        = "ssorequests"
              + "DB_PASSWORD"                    = (sensitive)
              + "DB_USERNAME"                    = (sensitive)
              + "GH_ACCESS_TOKEN"                = (sensitive)
              + "GH_BRANCH"                      = "main"
              + "GH_OWNER"                       = "bcgov"
              + "GH_REPO"                        = "sso-terraform-dev"
              + "GH_WORKFLOW_ID"                 = "request.yml"
              + "KEYCLOAK_DEV_CLIENT_ID"         = "terraform-cli"
              + "KEYCLOAK_DEV_CLIENT_SECRET"     = "d17d5e46-9f83-4137-9593-cebfc39b448e"
              + "KEYCLOAK_DEV_URL"               = "https://sso-keycloak-1-b861c7-test.apps.silver.devops.gov.bc.ca"
              + "KEYCLOAK_PROD_CLIENT_ID"        = "terraform-cli"
              + "KEYCLOAK_PROD_CLIENT_SECRET"    = "140837eb-1c0c-42e6-9fdb-64528731b914"
              + "KEYCLOAK_PROD_URL"              = "https://sso-keycloak-3-b861c7-test.apps.silver.devops.gov.bc.ca"
              + "KEYCLOAK_TEST_CLIENT_ID"        = "terraform-cli"
              + "KEYCLOAK_TEST_CLIENT_SECRET"    = "1ceab6be-7d41-443a-a06d-a1a7a20fa941"
              + "KEYCLOAK_TEST_URL"              = "https://sso-keycloak-2-b861c7-test.apps.silver.devops.gov.bc.ca"
              + "KEYCLOAK_V2_DEV_CLIENT_ID"      = "terraform-cli"
              + "KEYCLOAK_V2_DEV_CLIENT_SECRET"  = "50b05b0d-c898-4eb8-964e-cd6cb1526d15"
              + "KEYCLOAK_V2_DEV_URL"            = "https://sso-keycloak-4-b861c7-test.apps.silver.devops.gov.bc.ca"
              + "KEYCLOAK_V2_PROD_CLIENT_ID"     = "terraform-cli"
              + "KEYCLOAK_V2_PROD_CLIENT_SECRET" = "46ed38db-4d74-4624-aea4-b4bf9623f036"
              + "KEYCLOAK_V2_PROD_URL"           = "https://sso-keycloak-6-b861c7-test.apps.silver.devops.gov.bc.ca"
              + "KEYCLOAK_V2_TEST_CLIENT_ID"     = "terraform-cli"
              + "KEYCLOAK_V2_TEST_CLIENT_SECRET" = "1f865ea6-57a1-4989-9cae-5a63caf3e71c"
              + "KEYCLOAK_V2_TEST_URL"           = "https://sso-keycloak-5-b861c7-test.apps.silver.devops.gov.bc.ca"
              + "LOCAL_DEV"                      = "false"
              + "NODE_ENV"                       = "production"
              + "SSO_CLIENT_ID"                  = (sensitive)
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0dd30e1d7b3040e06",
            ]
          + subnet_ids         = [
              + "subnet-048e25be105ae01d3",
              + "subnet-0896ff158c3ecdc53",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-08-18T19:59:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "uUC8Awf0QYMCOc2yFF1KRR4xSKVvBGvHjX2yAvET9SI=" -> "ZCFD28qC0/7kYmMHoC3b2J9tu/vZiYa0WjHhBWMdi2Y="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduler will be updated in-place
  ~ resource "aws_lambda_function" "scheduler" {
        id                             = "lambda-scheduler"
      ~ last_modified                  = "2022-08-18T19:59:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "CMikt9jTjmH7L/cOo58TnYGmTgNaKwXvz1TkmN0MDB4=" -> "ufPWe9jX99chQff1JeEmEAaHJBIQcnY/lMM8XkCE9Ls="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_permission.apigw_api will be created
  + resource "aws_lambda_permission" "apigw_api" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "lambda-css-api"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ca-central-1:220881534007:gcp9dahm4c/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

Plan: 7 to add, 4 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url     = "https://gcp9dahm4c.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-08-18T19:59:48.833Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 5 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*